{
    "schemaVersion": "1.0.0",
    "ruleSetName": "VibeX Security & Privacy Rules",
    "version": "1.0.0",
    "description": "Rules enforcing privacy-first, secure-by-default principles in VibeX to protect user data and prevent unauthorized access.",
    "enforcedBy": "VibeX AI Security Auditor",
    "philosophy": "Security is not optional. Privacy is a feature. Default state of the system must be locked down, not permissive.",
  
    "rules": [
      {
        "ruleId": "SEC-01",
        "name": "Private by Default",
        "description": "All data, APIs, and storage must assume private access unless explicitly marked public.",
        "guidelines": [
          "No sensitive data should be exposed in client logs.",
          "APIs must implement authentication/authorization by default."
        ]
      },
      {
        "ruleId": "SEC-02",
        "name": "Local Storage & IndexedDB Policy",
        "description": "All stored data must follow encryption/masking rules to prevent exposure in case of unauthorized access.",
        "guidelines": [
          "Do not store raw PII or secrets in localStorage/IndexedDB.",
          "Sensitive tokens must be encrypted or replaced with opaque identifiers.",
          "Implement schema versioning and migration for stored data."
        ]
      },
      {
        "ruleId": "SEC-03",
        "name": "External API Access Control",
        "description": "No external API calls allowed without being whitelisted in the config.",
        "guidelines": [
          "All third-party calls must go through an allow-list.",
          "Every call must be logged and auditable."
        ]
      },
      {
        "ruleId": "SEC-04",
        "name": "Signed Links & Expiry",
        "description": "All file access links must be signed with TTL (time-to-live) and revocation capability.",
        "guidelines": [
          "Do not use permanent public URLs for assets containing user-related data.",
          "Signed links must expire within a safe window (default: 15 minutes)."
        ]
      },
      {
        "ruleId": "SEC-05",
        "name": "No Hardcoded Secrets",
        "description": "Secrets must never be committed to the repo or hardcoded in the codebase.",
        "guidelines": [
          "Use environment variables for secrets.",
          "Secrets must be managed via secure vault (e.g., Google Secret Manager)."
        ]
      }
    ],
  
    "implementationProtocol": {
      "title": "Security & Privacy Enforcement Protocol",
      "steps": [
        {
          "step": 1,
          "name": "Check Data Sensitivity",
          "action": "Identify if data is PII, sensitive, or internal-only before storing or transmitting."
        },
        {
          "step": 2,
          "name": "Apply Default Lockdown",
          "action": "Assume private mode unless explicitly set public by design."
        },
        {
          "step": 3,
          "name": "Audit External Calls",
          "action": "Verify API calls are on the allow-list and comply with logging rules."
        },
        {
          "step": 4,
          "name": "Run Security Scan",
          "action": "Perform static analysis (SAST) and dependency vulnerability scan before merge."
        }
      ]
    },
  
    "verification": {
      "storage_check": "Ensure no raw PII is stored in localStorage/IndexedDB.",
      "secret_check": "Repo scan must detect 0 hardcoded secrets.",
      "api_check": "All external API calls must be documented and whitelisted.",
      "runtime_check": "Penetration test simulation must confirm no data leakage."
    }
  }